[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/isurushanaka/AII_Course-1/blob/main/Data%20Preprocessing/data_preprocessing.ipynb)

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
!git clone "https://github.com/isurushanaka/AII_Course-1.git"

In [23]:
import pandas as pd

# Load the dataset
df = pd.read_csv('/content/AII_Course-1/Data Preprocessing/income.csv')

In [7]:
df.head()

      name   age   income  gender category
0     John  25.0  50000.0    Male        A
1     Lisa  30.0  60000.0  Female        B
2     Mark  35.0  70000.0    Male        A
3     Sara  28.0  55000.0  Female        C
4  Michael  32.0  65000.0    Male        B

In [8]:
df.tail()

       name   age   income  gender category
466     Zoe  36.0  67000.0  Female        A
467  Elijah  24.0  52000.0    Male        B
468     NaN  31.0  60000.0  Female        C
469  Xavier  23.0      NaN    Male        A
470    Luna  35.0  66000.0  Female        B

### Data Cleaning and Handling Missing Values:

In [9]:
# Check for missing values
print(df.isnull().sum())

name        5
age         4
income      5
gender      5
category    4
dtype: int64

In [24]:
# Fill missing values with mean
df['age'] = df['age'].fillna(df['age'].mean())

# Fill missing values with mode
df['income'] = df['income'].fillna(df['income'].mode()[0])

In [25]:
# Check for missing values
print(df.isnull().sum())

name        5
age         0
income      0
gender      5
category    4
dtype: int64

In [26]:
# Drop rows with missing values
df = df.dropna()

In [27]:
# Check for missing values
print(df.isnull().sum())

name        0
age         0
income      0
gender      0
category    0
dtype: int64

In [16]:
df.head()

      name   age   income  gender category
0     John  25.0  50000.0    Male        A
1     Lisa  30.0  60000.0  Female        B
2     Mark  35.0  70000.0    Male        A
3     Sara  28.0  55000.0  Female        C
4  Michael  32.0  65000.0    Male        B

In [17]:
df.tail()

          name   age   income  gender category
465  Sebastian  28.0  55000.0    Male        C
466        Zoe  36.0  67000.0  Female        A
467     Elijah  24.0  52000.0    Male        B
469     Xavier  23.0  52000.0    Male        A
470       Luna  35.0  66000.0  Female        B

### Feature Scaling and Normalization:

In [22]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

# Apply Min-Max scaling
scaler = MinMaxScaler()
scaled_data = scaler.fit_transform(df[['age', 'income']]) # scaled_data is a numpy array

df[['age','income']] = pd.DataFrame(scaled_data, columns=['age','income'])
df.head()

      name       age    income  gender category
0     John  0.153846  0.111111    Male        A
1     Lisa  0.538462  0.481481  Female        B
2     Mark  0.923077  0.851852    Male        A
3     Sara  0.384615  0.296296  Female        C
4  Michael  0.692308  0.666667    Male        B

In [28]:
# Apply Standard scaling
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df[['age', 'income']]) # scaled_data is a numpy array

df[['age','income']] = pd.DataFrame(scaled_data, columns=['age','income'])
df.head()

      name       age    income  gender category
0     John -1.203844 -1.446541    Male        A
1     Lisa  0.070894  0.295407  Female        B
2     Mark  1.345632  2.037355    Male        A
3     Sara -0.439001 -0.575567  Female        C
4  Michael  0.580789  1.166381    Male        B

### Handling Categorical Data:

In [29]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

# Convert categorical variable to numerical using LabelEncoder
label_encoder = LabelEncoder()
df['gender_encoded'] = label_encoder.fit_transform(df['gender'])

In [30]:
df.head()

      name       age    income  gender category  gender_encoded
0     John -1.203844 -1.446541    Male        A               1
1     Lisa  0.070894  0.295407  Female        B               0
2     Mark  1.345632  2.037355    Male        A               1
3     Sara -0.439001 -0.575567  Female        C               0
4  Michael  0.580789  1.166381    Male        B               1

In [41]:
# Perform One-Hot Encoding
onehot_encoder = OneHotEncoder()
onehot_encoded = onehot_encoder.fit_transform(df[['category']])
onehot_encoded

<457x3 sparse matrix of type '<class 'numpy.float64'>'
	with 457 stored elements in Compressed Sparse Row format>

In [40]:
type(onehot_encoded)

scipy.sparse._csr.csr_matrix